// 상품 정보 객체 리스트
// ----------------------------------------------------------
// 작성 예시
// -상품 이름, price는 가격, colors는 색상 배열, sizes는 사이즈 배열
// ----------------------------------------------------------

const products = {
  럽미모어세트: {
    basePrice: 17280,
    // (주니어 20160원)
    colors: ["옐로우", "소라", "백메란지", "오트밀", "핑크"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  베이직상하세트: {
    basePrice: 17280,
    // (주니어 20160원)
    colors: ["오트밀", "그레이", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  과일젤리세트: {
    basePrice: 20160,
    // (주니어 23040원)
    colors: ["레드(토마토)", "옐로우(레몬)", "핑크(복숭아)", "퍼플(포도)"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  배색플리츠세트: {
    basePrice: 20160,
    // (주니어 23040원)
    colors: [
      "달마시안",
      "호피",
      "핑크꽃",
      "파랑꽃",
      "딸기",
      "캔디도트",
      "무지베이지",
      "무지블랙",
    ],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  시스루썸머자켓: {
    basePrice: 31680,
    // (주니어 34560원)
    colors: ["아이", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  단가라래쉬가드티: {
    basePrice: 20160,
    // (주니어 23040원)
    colors: ["핑크", "네이비"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  단가라래쉬가디Adult: {
    basePrice: 31680,
    colors: ["핑크", "네이비"],
    sizes: {
      FREE: 0,
    },
  },

  무드스윔웨어남아: {
    basePrice: 23040,
    // (주니어 27360원)
    colors: ["남아set"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 4320,
      JM: 4320,
      JL: 4320,
    },
  },

  무드스윔웨어여아: {
    basePrice: 27360,
    // (주니어 31680원)
    colors: ["여아set"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 4320,
      JM: 4320,
      JL: 4320,
    },
  },

  썸머아일렛실내복: {
    basePrice: 23040,
    // (주니어 25920원)
    colors: ["핑크", "소라"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  프릴플리츠세트: {
    basePrice: 23040,
    // (주니어 25920원)
    colors: ["옐로우", "핑크", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  체크지지미세트: {
    basePrice: 24480,
    // (주니어 27360원)
    colors: ["핑크", "소라"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  아일렛가디건세트: {
    basePrice: 24480,
    // (주니어 27360원)
    colors: ["옐로우", "핑크", "그레이"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  에르데님셋업: {
    basePrice: 38880,
    // (주니어 43200원)
    colors: ["진청"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 4320,
      JM: 4320,
      JL: 4320,
    },
  },

  퓨어원피스: {
    basePrice: 38880,
    // (주니어 43200원)
    colors: ["화이트", "레몬"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 4320,
      JM: 4320,
      JL: 4320,
    },
  },

  코지단가라티: {
    basePrice: 11520,
    // (주니어 14400원)
    colors: ["핑크", "소라", "그레이", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  소프트나시: {
    basePrice: 12960,
    // (주니어 15840원)
    colors: ["옐로우", "핑크", "올리브", "그레이"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  오팔반팔티: {
    basePrice: 12960,
    // (주니어 15840원)
    colors: ["옐로우", "블루"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  패턴반팔티: {
    basePrice: 12960,
    // (주니어 15840원)
    colors: ["도트", "과일", "토끼", "꽃"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  데일리반팔티: {
    basePrice: 14400,
    // (주니어 17280원)
    colors: ["크림", "핑크", "소라", "올리브", "그레이"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  데이단가라티: {
    basePrice: 14400,
    // (주니어 17280원)
    colors: ["옐로우", "소라", "네이비"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  브라이턴티: {
    basePrice: 14400,
    // (주니어 17280원)
    colors: ["옐로우", "그레이"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  하트펀칭티: {
    basePrice: 14400,
    // (주니어 17280원)
    colors: ["옐로우", "핑크"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  라이크반팔티: {
    basePrice: 17280,
    // (주니어 20160원)
    colors: ["화이트(복숭아)", "핑크(딸기)"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  아이스크림반팔티: {
    basePrice: 17280,
    // (주니어 20160원)
    colors: ["화이트", "베이지"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  리틀프렌즈티: {
    basePrice: 17280,
    // (주니어 20160원)
    colors: ["화이트", "백메란지"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  매쉬88져지티: {
    basePrice: 21600,
    // (주니어 24480원)
    colors: ["화이트", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  워크데님셔츠: {
    basePrice: 27360,
    // (주니어 30240원)
    colors: ["진청"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  하트블랑: {
    basePrice: 28800,
    // (주니어 33120원)
    colors: ["아이", "체크레드"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 4320,
      JM: 4320,
      JL: 4320,
    },
  },

  아일렛5부레깅스: {
    basePrice: 10080,
    // (주니어 12960원)
    colors: ["그레이", "블랙", "단가라"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  바스락반바지: {
    basePrice: 11520,
    // (주니어 14400원)
    colors: ["레드", "옐로우", "핑크", "민트", "블루", "베이지", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  에어컨바지무지: {
    basePrice: 12960,
    // (주니어 15840원)
    colors: ["크림", "핑크", "옐로우", "소라", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  프릴반바지: {
    basePrice: 14400,
    // (주니어 17280원)
    colors: ["옐로우", "핑크", "백메란지", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  부츠컷프릴팬츠: {
    basePrice: 15840,
    // (주니어 18720원)
    colors: ["핑크", "그레이", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  무지개반바지: {
    basePrice: 15840,
    // (주니어 18720원)
    colors: ["오렌지", "핑크", "블루"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  꽃에어컨바지: {
    basePrice: 18720,
    // (주니어 21600원)
    colors: ["옐로우", "핑크", "퍼플", "소라"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  데일리데님반바지: {
    basePrice: 24480,
    // (주니어 27360원)
    colors: ["스트라이프", "진청"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  워싱데님반바지: {
    basePrice: 25920,
    // (주니어 28800원)
    colors: ["연청"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  러블리스커트: {
    basePrice: 28800,
    // (주니어 31680원)
    colors: ["아이", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },

  바스락멜빵: {
    basePrice: 30240,
    // (주니어 33120원)
    colors: ["베이지", "블랙"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 0,
      JS: 2880,
      JM: 2880,
      JL: 2880,
    },
  },
};
