// 상품 정보 객체 리스트
// ----------------------------------------------------------
// 작성 예시
// -상품 이름, price는 가격, colors는 색상 배열, sizes는 사이즈 배열
// ----------------------------------------------------------

const products = {
  크리미후드: {
    basePrice: 24480,
    colors: ["아이", "소라체크"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  체리슈트: {
    basePrice: 17820,
    colors: ["빨강", "베이지"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  하트땡슈트: {
    basePrice: 18720,
    colors: ["도트", "하트"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  세인트슈트: {
    basePrice: 21600,
    colors: ["네이비줄", "핑크"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  그림나시블랑: {
    basePrice: 21600,
    colors: ["소라", "아이"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  그림바지: {
    basePrice: 12960,
    colors: ["소라", "아이"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  베리애플티: {
    basePrice: 11520,
    colors: ["청사과", "딸기"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
      XS: 0,
    },
  },

  지지미체크반바지: {
    basePrice: 8640,
    colors: ["소라", "레드", "올리브", "블랙"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  올리브반바지: {
    basePrice: 8640,
    colors: ["블랙", "아이", "올리브", "레드"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  하트골지나시: {
    basePrice: 10080,
    colors: ["크림", "소라", "먹색"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  // 이거 블랙이면 12960원임
  체커보드반바지: {
    basePrice: 11520,
    colors: ["올리브", "소라", "검정", "블랙"],
    colorPrice: {
      블랙: 1440,
    },
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  A블라우스: {
    basePrice: 15840,
    colors: ["소라", "아이"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  블라썸팬츠: {
    basePrice: 14400,
    colors: ["소라", "아이"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  쿨스판나시: {
    basePrice: 10080,
    colors: ["아이", "핑크"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  빠삐용셔츠: {
    basePrice: 21600,
    colors: ["블루줄", "베이지줄"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  보보숏츠: {
    basePrice: 10080,
    colors: ["버터", "스톤블루"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  포켓코튼반바지: {
    basePrice: 12960,
    colors: ["아이", "소라", "베이지"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  아임라그란티: {
    basePrice: 11520,
    colors: ["밤색", "소라"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  배색포인트티: {
    basePrice: 14400,
    colors: ["아이", "소라"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  큐트블루머: {
    basePrice: 17280,
    colors: ["아이", "연두"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  썸머쿨가디건: {
    basePrice: 14400,
    colors: ["아이", "레드줄"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },

  카라멜멜빵: {
    basePrice: 23040,
    colors: ["검정", "소라"],
    sizes: {
      "6M": 0,
      "12M": 0,
      "18M": 0,
    },
  },
};
