// 상품 정보 객체 리스트
// ----------------------------------------------------------
// 작성 예시
// -상품 이름, price는 가격, colors는 색상 배열, sizes는 사이즈 배열
// ----------------------------------------------------------

const products = {
  A상품: {
    basePrice: 12000,
    colors: ["노랑", "핑크", "베이지"],
    sizes: {
      S: 0,
      M: 0,
      L: 0,
      JS: 2000,
      JM: 2000,
    },
  },

  B상품: {
    basePrice: 18000,
    colors: ["블랙", "화이트"],
    sizes: {
      XS: 0,
      S: 0,
      M: 0,
      L: 0,
      XL: 3000,
    },
  },
};
